#p1
print("printing someting")
fName = "Sasha"
lName = "Gray"
age = 18
print("Hello, %s %s, you are %d allready" % (fName,lName, age))
user = input("and what is your name? :")

#p2
"""
Пользователь вводит время в секундах. 
Переведите время в часы, минуты, секунды и выведите в формате чч:мм:сс. 
Используйте форматирование строк
"""

#3
"""
Узнайте у пользователя число n. 
Найдите сумму чисел n + nn + nnn. 
Например, пользователь ввёл число 3. 
Считаем 3 + 33 + 333 = 369
"""

#4
"""
Пользователь вводит целое положительное число.
Найдите самую большую цифру в числе. 
Для решения используйте цикл while и арифметические операции.
"""
#5
"""
Запросите у пользователя значения выручки и издержек фирмы. 
Определите, с каким финансовым результатом работает фирма. 
Например, прибыль — выручка больше издержек, 
или убыток — издержки больше выручки. 
Выведите соответствующее сообщение.

Если фирма отработала с прибылью, 
вычислите рентабельность выручки. 
Это отношение прибыли к выручке. 
Далее запросите численность сотрудников фирмы 
и определите прибыль фирмы в расчёте на одного сотрудника.
"""

#6
"""
Спортсмен занимается ежедневными пробежками. 
В первый день его результат составил a километров. 
Каждый день спортсмен увеличивал результат на 10% относительно предыдущего. 
Требуется определить номер дня, 
на который результат спортсмена составит не менее b километров. 
Программа должна принимать значения параметров a и b 
и выводить одно натуральное число — номер дня.
"""